Tekla Open API Reference for Tekla Structures 2025
IPreferredPlacing.PreferredPlacing Property
 The type of placing the object should use. See PreferredPlacingTypes for different types of placing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
PreferredPlacingTypeBase PreferredPlacing { get; set; }
Property PreferredPlacing As PreferredPlacingTypeBase
	Get
	Set
Property Value
Type: PreferredPlacingTypeBase
See Also
Reference
IPreferredPlacing Interface
Tekla.Structures.Drawing Namespace